In [1]:
sub = ["DSA", "Pythom", "DBMS"]
marks = [33,34,35]
pd.Series(marks,sub)

NameError: name 'pd' is not defined

In [ ]:
marks = pd.Series([33,34,35],index = ["DSA", "Pythom", "DBMS"])

In [2]:
marks

[33, 34, 35]

In [3]:
d = {"Name":"Matin", "Course":"BCA", "Address":"Vadodara"}

In [4]:
student = pd.Series(d)

NameError: name 'pd' is not defined

In [5]:
student

NameError: name 'student' is not defined

In [6]:
student.values

NameError: name 'student' is not defined

In [7]:
student.keys()

NameError: name 'student' is not defined

In [94]:
import numpy as np

In [2]:
bc = pd.DataFrame(np.random.randint(1,100,(4,3)),index = ["Matin", "Ziyan", "Jay","Fardin"], columns = ["DSA","DBMS","Python"])

NameError: name 'pd' is not defined

In [ ]:
bc

In [ ]:
df[["DSA","DBMS"]]

In [ ]:
df["Total"]= df["DSA"]+df["DBMS"]+df["Python"]

In [ ]:
df

In [ ]:
df["Percentage "] = df["Total"]/3

In [3]:
df

NameError: name 'df' is not defined

In [4]:
df.loc[["Matin","Ziyan"]]

NameError: name 'df' is not defined

In [5]:
df.head(1)

NameError: name 'df' is not defined

In [6]:
df.tail(2)

NameError: name 'df' is not defined

In [7]:
df.loc["Matin":"Jay"]

NameError: name 'df' is not defined

In [8]:
df.loc["Jay":]

NameError: name 'df' is not defined

In [9]:
df.iloc[2]

NameError: name 'df' is not defined

In [10]:
df.drop("DBMS",axis=1,inplace = True)

NameError: name 'df' is not defined

In [11]:
df

NameError: name 'df' is not defined

In [12]:
import pandas as pd

In [13]:
productId = [1,2,3,4,5]
productName = ["Sampoo","Conditioner","Soap","Hand Wash","Sanitizer"]
productPrice = [20,30,40,50,60]

In [14]:
df = pd.DataFrame(data = [productId,productName,productPrice], index = ["productId","productName","productPrice"]).transpose()

In [15]:
df

  productId  productName productPrice
0         1       Sampoo           20
1         2  Conditioner           30
2         3         Soap           40
3         4    Hand Wash           50
4         5    Sanitizer           60

In [16]:
a["productPrice":]

NameError: name 'a' is not defined

In [17]:
a["productName":"productName"]

NameError: name 'a' is not defined

In [18]:
a.loc["productName"]

NameError: name 'a' is not defined

In [19]:
a.loc['productPrice']

NameError: name 'a' is not defined

In [20]:
for row in a.iterrows():
    print(row)

NameError: name 'a' is not defined

In [21]:
a.transpose?

Object `a.transpose` not found.

In [22]:
df.iloc[2:4]

  productId productName productPrice
2         3        Soap           40
3         4   Hand Wash           50

### df.iloc[1:,2]

In [23]:
df.iloc[1:4,1]

1    Conditioner
2           Soap
3      Hand Wash
Name: productName, dtype: object

In [24]:
df.iloc[1:2,2]

1    30
Name: productPrice, dtype: object

In [25]:
bc

NameError: name 'bc' is not defined

In [26]:
bc['DSA']<41

NameError: name 'bc' is not defined

In [27]:
ab = pd.DataFrame(np.random.randint(1,100,(4,3)),index = ["Matin", "Ziyan", "Jay","Fardin"], columns = ["DSA","DBMS","Python"])

In [28]:
ab

        DSA  DBMS  Python
Matin    95    29      46
Ziyan    62    45      52
Jay      25    93      87
Fardin   83    57      53

In [29]:
ab.loc[ab['DSA']<40,'DSA']=41

In [30]:
ab

        DSA  DBMS  Python
Matin    95    29      46
Ziyan    62    45      52
Jay      41    93      87
Fardin   83    57      53

In [31]:
ab.loc[ab['DBMS']<40,'DBMS']=41

In [32]:
ab

        DSA  DBMS  Python
Matin    95    41      46
Ziyan    62    45      52
Jay      41    93      87
Fardin   83    57      53

In [33]:
[ab['DBMS']+2,'DBMS']

[Matin     43
 Ziyan     47
 Jay       95
 Fardin    59
 Name: DBMS, dtype: int32,
 'DBMS']

In [34]:
ab.add(2)

        DSA  DBMS  Python
Matin    97    43      48
Ziyan    64    47      54
Jay      43    95      89
Fardin   85    59      55

In [35]:
ab["Python"] < 50

Matin      True
Ziyan     False
Jay       False
Fardin    False
Name: Python, dtype: bool

In [36]:
ab.isnull()

          DSA   DBMS  Python
Matin   False  False   False
Ziyan   False  False   False
Jay     False  False   False
Fardin  False  False   False

In [37]:
ab.notnull()

         DSA  DBMS  Python
Matin   True  True    True
Ziyan   True  True    True
Jay     True  True    True
Fardin  True  True    True

In [38]:
ab.dropna()

        DSA  DBMS  Python
Matin    95    41      46
Ziyan    62    45      52
Jay      41    93      87
Fardin   83    57      53

In [39]:
ab.dropna(axis=1)

        DSA  DBMS  Python
Matin    95    41      46
Ziyan    62    45      52
Jay      41    93      87
Fardin   83    57      53

In [40]:
ab.dropna(thresh=2)

        DSA  DBMS  Python
Matin    95    41      46
Ziyan    62    45      52
Jay      41    93      87
Fardin   83    57      53

In [41]:
ab.fillna(value=5)

        DSA  DBMS  Python
Matin    95    41      46
Ziyan    62    45      52
Jay      41    93      87
Fardin   83    57      53

In [42]:
ab.fillna(method="ffill")

        DSA  DBMS  Python
Matin    95    41      46
Ziyan    62    45      52
Jay      41    93      87
Fardin   83    57      53

In [43]:
ab.fillna(method="bfill")

        DSA  DBMS  Python
Matin    95    41      46
Ziyan    62    45      52
Jay      41    93      87
Fardin   83    57      53

In [44]:
data = {'A': [1, 2, np.nan, 4, 5],
        'B': [10, np.nan, 30, 40, 50],
        'C': [100, 200, 300, np.nan, 500]}

In [45]:
data

{'A': [1, 2, nan, 4, 5],
 'B': [10, nan, 30, 40, 50],
 'C': [100, 200, 300, nan, 500]}

In [46]:
productNme = ["A","B","C"]
productNum = [10, np.nan, 30, 40, 50]
productPrice = [100, 200, 300, np.nan, 500]

In [47]:
data1 = pd.DataFrame(data = [productNme,productNum,productPrice], index = ["productName","productNum","productPrice"]).transpose()

In [48]:
data1

  productName productNum productPrice
0           A         10          100
1           B        NaN          200
2           C         30          300
3         NaN       40.0          NaN
4         NaN       50.0        500.0

In [49]:
data1.isnull()

   productName  productNum  productPrice
0        False       False         False
1        False        True         False
2        False       False         False
3         True       False          True
4         True       False         False

In [50]:
data1.notnull()

   productName  productNum  productPrice
0         True        True          True
1         True       False          True
2         True        True          True
3        False        True         False
4        False        True          True

In [51]:
bc.to_dict()

NameError: name 'bc' is not defined

In [52]:
bc.to_json()

NameError: name 'bc' is not defined

In [53]:
bc.to_html()

NameError: name 'bc' is not defined

In [54]:
bc.dtypes()

NameError: name 'bc' is not defined

In [55]:
df = pd.read_csv("Salaries.csv")

C:\Users\ratho\AppData\Local\Temp\ipykernel_16216\91212481.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("Salaries.csv")

In [56]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [57]:
df.info

<bound method DataFrame.info of             Id       EmployeeName  \
0            1     NATHANIEL FORD
1            2       GARY JIMENEZ
2            3     ALBERT PARDINI
3            4  CHRISTOPHER CHONG
4            5    PATRICK GARDNER
...        ...                ...
148649  148650      Roy I Tillery
148650  148651       Not provided
148651  148652       Not provided
148652  148653       Not provided
148653  148654          Joe Lopez

                                              JobTitle       BasePay  \
0       GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY     167411.18
1                      CAPTAIN III (POLICE DEPARTMENT)     155966.02
2                      CAPTAIN III (POLICE DEPARTMENT)     212739.13
3                 WIRE ROPE CABLE MAINTENANCE MECHANIC       77916.0
4         DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)      134401.6
...                                                ...           ...
148649                                       Custodian          0.00
148650                                    Not provided  Not Provided
148651                                    Not provided  Not Provided
148652                                    Not provided  Not Provided
148653                      Counselor, Log Cabin Ranch          0.00

         OvertimePay      OtherPay      Benefits   TotalPay  TotalPayBenefits  \
0                0.0     400184.25           NaN  567595.43         567595.43
1          245131.88     137811.38           NaN  538909.28         538909.28
2          106088.18       16452.6           NaN  335279.91         335279.91
3           56120.71      198306.9           NaN  332343.61         332343.61
4             9737.0     182234.59           NaN  326373.19         326373.19
...              ...           ...           ...        ...               ...
148649          0.00          0.00          0.00       0.00              0.00
148650  Not Provided  Not Provided  Not Provided       0.00              0.00
148651  Not Provided  Not Provided  Not Provided       0.00              0.00
148652  Not Provided  Not Provided  Not Provided       0.00              0.00
148653          0.00       -618.13          0.00    -618.13           -618.13

        Year  Notes         Agency Status
0       2011    NaN  San Francisco    NaN
1       2011    NaN  San Francisco    NaN
2       2011    NaN  San Francisco    NaN
3       2011    NaN  San Francisco    NaN
4       2011    NaN  San Francisco    NaN
...      ...    ...            ...    ...
148649  2014    NaN  San Francisco     PT
148650  2014    NaN  San Francisco    NaN
148651  2014    NaN  San Francisco    NaN
148652  2014    NaN  San Francisco    NaN
148653  2014    NaN  San Francisco     PT

[148654 rows x 13 columns]>

In [58]:
df =df.replace("Not Provided",np.NAN)

In [59]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [60]:
df =df.replace("Not provided",np.NAN)

In [61]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,NaN,NaN,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,NaN,NaN,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,NaN,NaN,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148648 non-null  object
 2   JobTitle          148650 non-null  object
 3   BasePay           148045 non-null  object
 4   OvertimePay       148650 non-null  object
 5   OtherPay          148650 non-null  object
 6   Benefits          112491 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [63]:
df['BasePay'] = df['BasePay'].astype('float')

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148648 non-null  object
 2   JobTitle          148650 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  object
 5   OtherPay          148650 non-null  object
 6   Benefits          112491 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(4), int64(2), object(7)
memory usage: 14.7+ MB

In [65]:
df['BasePay'].mean()

66325.4488404877

In [66]:
df['OvertimePay'] = df['OvertimePay'].astype('float')

In [67]:
df['OvertimePay'].max()

245131.88

In [68]:
joseph_job_title = df.loc[df['EmployeeName'] == "JOSEPH DRISCOLL","JobTitle"]

In [69]:
print("Josephs Job Title is :",joseph_job_title)

Josephs Job Title is : 24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [70]:
josephEarning = df.loc[df["EmployeeName"] == "JOSEPH DRISCOLL","TotalPay" ]

In [71]:
josephEarning

24    270324.91
Name: TotalPay, dtype: float64

In [72]:
#9. What is the name of highest paid person (including benefits)
MaxEarner = df.loc[df["TotalPay"].idxmax(),'EmployeeName' ]

In [73]:
print('the name of highest paid person is :',MaxEarner)

the name of highest paid person is : NATHANIEL FORD

In [74]:
#What is the name of lowest paid person (including benefits)? Do you notice something strangeabout how much he or she is paid?
lowestEarner = df.loc[df['TotalPay'].idxmin(), 'EmployeeName']

In [75]:
lowestEarner

'Joe Lopez'

In [76]:
JoeLopezEarning = df.loc[df["EmployeeName"] == "lowestEarner","TotalPay" ]

In [77]:
JoeLopezEarning

Series([], Name: TotalPay, dtype: float64)

In [78]:
average_basepay_per_year = df[df['Year'].between(2011, 2014)].groupby('Year')['BasePay'].mean()

In [79]:
average_basepay_per_year

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [80]:
Number_Of_Unique_Job_Titles = df['JobTitle'].nunique()

In [81]:
Number_Of_Unique_Job_Titles

2158

In [82]:
uniqueJobTitle = df['JobTitle'].unique()

In [83]:
uniqueJobTitle

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', nan], dtype=object)

In [89]:
#FOR MOST COMMON JOBS WE USE .VALUE_COUNTS().HEAD('no of counts')
CommonJobes = df['JobTitle'].value_counts().head(5)

In [90]:
CommonJobes

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

In [102]:
#FOR LEAST COMMON WE USE.VALUE_COUNTS().tails("no of counts")
LeastCommonJobs = df['JobTitle'].value_counts().tail(6)

In [103]:
LeastCommonJobs

JobTitle
PRINCIPAL INVESTIGATOR, TAX COLLECTOR    1
BUILDING SERVICES TECHNICIAN             1
TRIAL DELAY REDUCTION COORDINATOR        1
POWERHOUSE ELECTRICIAN SUPERVISOR II     1
CHIEF NURSERY SPECIALIST                 1
Cashier 3                                1
Name: count, dtype: int64

In [105]:
#How many Job Titles were represented by only one person in 2013?
df_2013 = df[df['Year'] == 2013]

# Count the number of job titles represented by only one person in 2013
unique_job_titles_2013 = df_2013['JobTitle'].value_counts()
job_titles_one_person_2013 = unique_job_titles_2013[unique_job_titles_2013 == 1].count()

In [106]:
job_titles_one_person_2013

202

In [109]:
# How many people have the word Chief in their job title
chief_count = df[df['JobTitle'].str.contains('Chief', case=False, na=False)].shape[0]

In [110]:
chief_count

627

In [114]:
df_cleaned = df.dropna(subset=['JobTitle', 'TotalPayBenefits'])

# Add a new column for the length of the Job Title
df_cleaned['Job Title Length'] = df_cleaned['JobTitle'].apply(len)

# Calculate the correlation coefficient between Job Title Length and Salary
correlation = df_cleaned['Job Title Length'].corr(df_cleaned['TotalPayBenefits'])

C:\Users\ratho\AppData\Local\Temp\ipykernel_16216\1160874245.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned['Job Title Length'] = df_cleaned['JobTitle'].apply(len)